In [6]:
import pandas as pd
import numpy as np 
import matplotlib.pyplot as plt 
import seaborn as sns 
import plotly.express as px
from plotly.subplots import make_subplots
from datetime import datetime

In [32]:
df = pd.read_csv("/Users/mrbinit/Downloads/data/demand.csv")
sf = pd.read_csv("/Users/mrbinit/Downloads/data/supply.csv")

In [33]:
df.head(10)

,DATE,CSUSHPISA,MORTGAGE30US,UMCSENT,INTDSRUSM193N,MSPUS,GDP
0,01-01-2003,129.321000,5.840769,79.966667,2.250000,186000,11174.129
1,01-04-2003,131.756000,5.506923,89.266667,2.166667,191800,11312.766
2,01-07-2003,135.013000,6.033846,89.300000,2.000000,191900,11566.669
3,01-10-2003,138.835667,5.919286,91.966667,2.000000,198800,11772.234
4,01-01-2004,143.298667,5.597500,98.000000,2.000000,212700,11923.447
5,01-04-2004,148.209000,6.106154,93.333333,2.083333,217600,12112.815
6,01-07-2004,152.716667,5.894286,95.600000,2.500000,213500,12305.307
7,01-10-2004,157.535333,5.736154,93.866667,3.000000,228800,12527.214
8,01-01-2005,163.481333,5.768462,94.066667,3.500000,232500,12767.286
9,01-04-2005,169.347333,5.708462,90.200000,4.000000,233700,12922.656

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 81 entries, 0 to 80
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   DATE           81 non-null     object
 1   CSUSHPISA      80 non-null     float64
 2   MORTGAGE30US   81 non-null     float64
 3   UMCSENT        81 non-null     float64
 4   INTDSRUSM193N  74 non-null     float64
 5   MSPUS          81 non-null     int64
 6   GDP            81 non-null     float64
dtypes: float64(5), int64(1), object(1)
memory usage: 4.6+ KB

In [35]:
df.describe()

,CSUSHPISA,MORTGAGE30US,UMCSENT,INTDSRUSM193N,MSPUS,GDP
count,80.000000,81.000000,81.000000,74.000000,81.000000,81.000000
mean,180.658712,4.705420,82.149794,1.961712,281104.938272,17298.487852
std,41.410501,1.114588,12.408088,1.732885,68121.518078,3851.890323
min,129.321000,2.760714,56.100000,0.250000,186000.000000,11174.129000
25%,148.204500,3.822308,73.866667,0.750000,228100.000000,14448.882000
50%,172.270000,4.440000,82.966667,1.041667,258400.000000,16629.050000
75%,196.770917,5.768462,93.066667,2.562500,318400.000000,19894.750000
max,303.422667,6.664615,98.933333,6.250000,479500.000000,26465.865000

In [36]:
sf.head(10)

,DATE,CSUSHPISA,MSACSR,PERMIT,TLRESCONS,EVACANTUSQ176N
0,01-01-2003,129.321,4.2,1806.333333,421328.6667,14908
1,01-04-2003,131.756,3.833333333,1837.666667,429308.6667,15244
2,01-07-2003,135.013,3.633333333,1937.333333,458890,15614
3,01-10-2003,138.8356667,3.966666667,1972.333333,491437.3333,15654
4,01-01-2004,143.2986667,3.7,1994.666667,506856.3333,15895
5,01-04-2004,148.209,3.9,2080,526483.3333,16079
6,01-07-2004,152.7166667,4.3,2069.666667,552939,15656
7,01-10-2004,157.5353333,4.1,2086,561413.3333,15361
8,01-01-2005,163.4813333,4.266666667,2105,590790.3333,15748
9,01-04-2005,169.3473333,4.266666667,2137.666667,611957,16061